# organization-shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/organization/shared/infrastructure/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production-organization/runs/run-CLjK9MuVYHciNQRT

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Refreshing...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=d5e95d51-8496-4e8d-977c-501839a34d0f:production-organization]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=d5e95d51-8496-4e8d-977c-501839a34d0f:production-organization-database-migration]
module.common_resources.module.database.cockroach_database.default: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-organization-database-migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "d5e95d51-8496-4e8d-977c-501839a34d0f:production-organization-database-migration"
        name       = "production-organization-database-migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "fd98fde3-4a6d-40b9-8218-337c74d1c0a4" -> "c5c248f2-0006-45be-b81a-6fd332f8e83a"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*